wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_hpdf.h
/* regular conversions configuration params */
typedef struct {
    uint32_t fast_mode;                         /*!< fast conversion mode enable for regular conversions */
    uint32_t rcs_channel;                       /*!< regular conversion channel */
    uint32_t rcdmaen;                           /*!< DMA channel enabled to read data for the regular conversion */
    uint32_t rcsyn;                             /*!< regular conversion synchronously */
    uint32_t continuous_mode;                   /*!< regular conversions continuous mode */
} hpdf_rc_parameter_struct;

/* inserted conversions configuration params */
typedef struct {
    uint32_t trigger_edge;                      /*!< inserted conversions trigger edge */
    uint32_t trigger_signal;                    /*!< inserted conversions trigger signal */
    uint32_t icdmaen;                           /*!< DMA channel enabled to read data for the inserted channel group */
    uint32_t scmod;                             /*!< scan conversion mode of inserted conversions */
    uint32_t icsyn;                             /*!< inserted conversion synchronously */
    uint32_t ic_channel_group;                  /*!< inserted channel group selection */
} hpdf_ic_parameter_struct;

/* enum definitions */
/* HPDF channel */
typedef enum {
    CHANNEL0 = 0,                               /*!< HPDF channel0 */
    CHANNEL1,                                   /*!< HPDF channel1 */
    CHANNEL2,                                   /*!< HPDF channel2 */
    CHANNEL3,                                   /*!< HPDF channel3 */
    CHANNEL4,                                   /*!< HPDF channel4 */
    CHANNEL5,                                   /*!< HPDF channel5 */
    CHANNEL6,                                   /*!< HPDF channel6 */
    CHANNEL7                                    /*!< HPDF channel7 */
} hpdf_channel_enum;

/* HPDF filter */
typedef enum {
    FLT0 = 0,                                   /*!< HPDF filter0 */
    FLT1,                                       /*!< HPDF filter1 */
    FLT2,                                       /*!< HPDF filter2 */
    FLT3                                        /*!< HPDF filter3 */
} hpdf_filter_enum;

/* HPDF channel definitions */
/* serial clock output source definitions */
#define SERIAL_SYSTEM_CLK               ((uint32_t)0x00000000U)                         /*!< serial clock output source is from system clock */
#define SERIAL_AUDIO_CLK                HPDF_CH0CTL_CKOUTSEL                            /*!< serial clock output source is from audio clock */

/* serial clock output duty mode definitions */
#define CKOUTDM_DISABLE                 ((uint32_t)0x00000000U)                         /*!< serial clock output duty mode disable */
#define CKOUTDM_ENABLE                  HPDF_CH0CTL_CKOUTDM                             /*!< serial clock output duty mode enable */

/* data packing mode definitions */
#define DPM(regval)                     (BITS(14,15) & ((uint32_t)(regval) << 14))      /*!< select data packing mode */
#define DPM_STANDARD_MODE               DPM(0)                                          /*!< standard mode */
#define DPM_INTERLEAVED_MODE            DPM(1)                                          /*!< interleaved mode */
#define DPM_DUAL_MODE                   DPM(2)                                          /*!< dual mode */

/* input data source for channel definitions */
#define IDATASEL(regval)                (BITS(12,13) & ((uint32_t)(regval) << 12))      /*!< select channel y multiplexer input data source */
#define SERIAL_INPUT                    IDATASEL(0)                                     /*!< input data source for channel is taken from serial inputs */
#define ADC_INPUT                       IDATASEL(1)                                     /*!< input data source for channel is taken from  ADC output register */
#define INTERNAL_INPUT                  IDATASEL(2)                                     /*!< input data source for channel is taken from internal HPDF_CHXPDI register */

/* channel inputs pins definitions */
#define CHPINSEL_CURRENT                ((uint32_t)0x00000000U)                         /*!< channel inputs select pins of the current channel */
#define CHPINSEL_NEXT                   HPDF_CHXCTL_CHPINSEL                            /*!< channel inputs select pins of the next channel */

/* clock loss detector definitions */
#define CLK_LOSS_DISABLE                ((uint32_t)0x00000000U)                         /*!< clock loss detector disable */
#define CLK_LOSS_ENABLE                 HPDF_CHXCTL_CKLEN                               /*!< clock loss detector enable */

/* SPI clock source definitions */
#define SPICKSS(regval)                 (BITS(2,3) & ((uint32_t)(regval) << 2))         /*!< select SPI clock source */
#define EXTERNAL_CKIN                   SPICKSS(0)                                      /*!< external CKINy input */
#define INTERNAL_CKOUT                  SPICKSS(1)                                      /*!< internal CKOUT output */
#define HALF_CKOUT_FALLING_EDGE         SPICKSS(2)                                      /*!< internal CKOUT output, sampling point on each second CKOUT falling edge. */
#define HALF_CKOUT_RISING_EDGE          SPICKSS(3)                                      /*!< internal CKOUT output, sampling point on each second CKOUT rising edge */

/* serial interface type definitions */
#define SITYP(regval)                   (BITS(0,1) & ((uint32_t)(regval)))              /*!< select serial interface type */
#define SPI_RISING_EDGE                 SITYP(0)                                        /*!< SPI interface, sample data on rising edge */
#define SPI_FALLING_EDGE                SITYP(1)                                        /*!< SPI interface, sample data on falling edge */
#define MANCHESTER_CODE0                SITYP(2)                                        /*!< manchester coded input: rising edge = logic 0, falling edge = logic 1 */
#define MANCHESTER_CODE1                SITYP(3)                                        /*!< manchester coded input: rising edge = logic 1, falling edge = logic 0 */

/* malfunction monitor detector definitions */
#define MM_DISABLE                      ((uint32_t)0x00000000U)                         /*!< malfunction monitor disable */
#define MM_ENABLE                       HPDF_CHXCTL_MMEN                                /*!< malfunction monitor enable */

/* malfunction monitor detector break signal definitions */
#define MMBSD(regval)                   (BITS(12,15) & ((uint32_t)(regval)<< 12 ))      /*!< select break signal on channel */
#define NO_MM_BREAK                     MMBSD(0)                                        /*!< break signal is not distributed to malfunction monitor on channel */
#define MM_BREAK0                       MMBSD(1)                                        /*!< break signal 0 is distributed to malfunction monitor on channel */
#define MM_BREAK1                       MMBSD(2)                                        /*!< break signal 1 is distributed to malfunction monitor on channel */
#define MM_BREAK2                       MMBSD(4)                                        /*!< break signal 2 is distributed to malfunction monitor on channel */
#define MM_BREAK3                       MMBSD(8)                                        /*!< break signal 3 is distributed to malfunction monitor on channel */

/* threshold monitor fast mode definitions */
#define TMFM_DISABLE                    ((uint32_t)0x00000000U)                         /*!< threshold monitor fast mode disable */
#define TMFM_ENABLE                     HPDF_FLTYCTL0_TMFM                              /*!< threshold monitor fast mode enable */

/* regular conversions configuration definitions */
/* fast conversion mode definitions */
#define FAST_DISABLE                    ((uint32_t)0x00000000U)                         /*!< fast conversion mode disable */
#define FAST_ENABLE                     HPDF_FLTYCTL0_FAST                              /*!< fast conversion mode enable */

/* regular conversion channel selection definitions */
#define RCS(regval)                     (BITS(24,26) & ((uint32_t)(regval)<< 24 ))      /*!< select regular conversion channel */
#define RCS_CHANNEL0                    RCS(0)                                          /*!< channel 0 is selected as the regular conversion channel */
#define RCS_CHANNEL1                    RCS(1)                                          /*!< channel 1 is selected as the regular conversion channel */
#define RCS_CHANNEL2                    RCS(2)                                          /*!< channel 2 is selected as the regular conversion channel */
#define RCS_CHANNEL3                    RCS(3)                                          /*!< channel 3 is selected as the regular conversion channel */
#define RCS_CHANNEL4                    RCS(4)                                          /*!< channel 4 is selected as the regular conversion channel */
#define RCS_CHANNEL5                    RCS(5)                                          /*!< channel 5 is selected as the regular conversion channel */
#define RCS_CHANNEL6                    RCS(6)                                          /*!< channel 6 is selected as the regular conversion channel */
#define RCS_CHANNEL7                    RCS(7)                                          /*!< channel 7 is selected as the regular conversion channel */

